preconcentrationCE/Sample_stacking/10_5sample_stacking/constant/ampholyteProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.7.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 ampholytes
 ( 
MES 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 7.238182100844691e-10; 
 mobility 6(0.0 0.0 0.0 2.8000000000000003e-08 0.0 0.0); 
 pk 6(1000000.0 100000.0 10000.0 0.0008035261221856177 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
HISTIDINE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.2279058921075814e-09; 
 mobility 6(0.0 4.75e-08 2.6800000000000002e-08 2.8300000000000002e-08 0.0 0.0); 
 pk 6(1000000.0 9.772372209558112 0.0009120108393559096 4.677351412871981e-07 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
ARGININE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.5768896719697361e-09; 
 mobility 6(0.0 6.1e-08 2.55e-08 2.69e-08 0.0 0.0); 
 pk 6(1000000.0 26.302679918953814 1.205035940371796e-06 3.3113112148259076e-10 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
LYSINE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.4243708348447947e-09; 
 mobility 6(0.0 5.5100000000000004e-08 2.8600000000000005e-08 2.64e-08 0.0 0.0); 
 pk 6(1000000.0 16.218100973589298 7.464487584100654e-07 1.6218100973589333e-08 1e-13 1e-14);
 K1 4(0.0 0.0 0.0 0.0);
 K2 16(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
    );
/***************paper parameters*******************/
 sigma_0 sigma_0 [-1 -3 2 0 1 1 0] 0;
 phip            phip [ 0 0 0 0 0 0 0 ] 1;
 taup            taup [ 0 0 0 0 0 0 0 ] 1;
 sc             sc [ 0 1 0 0 0 0 0 ] 0;
 se             se [ 0 1 0 0 0 0 0 ] 0;
 Kperm          Kperm   [ 0 2 0 0 0 0 0 ] 1;
 zeta           zeta [1 2 -3 0 0 -1 0] -0.0;
 rho_fluid rho_fluid  [1 -3 0 0 0 0 0] 1000.0;
/**************************************************************************/ 
